"""
Мета:
Ознайомитися з використанням різних операторів у Python, включаючи арифметичні, логічні, порівняння, та побітові оператори.

Завдання 1:
Напишіть програму, яка запитує у користувача два числа і виконує такі дії:
    Додає ці числа.
    Обчислює різницю між ними.
    Множить числа.
    Знаходить частку від ділення (як звичайного, так і цілочисельного) та залишок.

Завдання 2:
Запитайте у користувача його вік і перевірте:

    Чи менше або дорівнює його вік 30.
    У скільки разів ваш особистий вік менший/більший за введений користувачем.
"""

"""
a = eval(input("Введіть перше число: "))
b = eval(input("Введіть друге число: "))
z = a + b
c = a - b
d = a **2
y = a//b
t = a % b
print(f"Сума двох чисел: {z}")
print(f"Різниця двох чисел: {c}")
print(f"Піднесення до степеня: {d}")
print(f"Частка від ділення: {y}")
print(f"Модуль від ділення: {t}") """


age = eval (input("Введіть ваш вік: "))
print(age)

if age < 30:
    print("Вам менше 30")
    print("Ви ще молодий")
else:
    print("Вам більше 30")
    print("Пора на пенсію")







