"""
Мета:
Ознайомитися з використанням різних операторів у Python, включаючи арифметичні, логічні, порівняння, та побітові оператори.

Завдання 1:
Напишіть програму, яка запитує у користувача два числа і виконує такі дії:
    Додає ці числа.
    Обчислює різницю між ними.
    Множить числа.
    Знаходить частку від ділення (як звичайного, так і цілочисельного) та залишок.

Завдання 2:
Запитайте у користувача його вік і перевірте:

    Чи менше або дорівнює його вік 30.
    У скільки разів ваш особистий вік менший/більший за введений користувачем.
"""