"""
Мета:
Навчитися працювати з функцією eval(), створювати інтерактивні програми та використовувати обчислення рівнянь, що містять змінні x, y, z.

Створіть програму, яка:
1. Просить користувача ввести рівняння з трьома змінними x, y, z.
2. Запитує значення для змінних x, y та z.
3. Обчислює результат рівняння, використовуючи функцію eval(), та виводить його на екран.

__________________________________________________________________________________________
Приклад роботи:

Користувач вводить рівняння:
2 * x + y ** 2 - z

Програма запитує значення змінних:
Введіть значення x: 3
Введіть значення y: 4
Введіть значення z: 2

Програма виводить результат:
Результат обчислення рівняння 2 * x + y ** 2 - z дорівнює 20
"""


equation = input("Введіть рівняння із x, y, z: ")
x = eval(input("Введіть значення x: "))
y = int(input("Введіть значення y: "))
z = int(input("Введіть значення z: "))

result = eval(equation)
print(f"Результат {result}")
