"""
Завдання 1:

Напишіть програму, яка створює словник з інформацією про улюблених тварин ваших друзів.

Ваше завдання:

    Запитайте у користувача імена трьох друзів.
    Для кожного друга запитайте улюблену тварину.
    Створіть словник, де ключем буде ім'я друга, а значенням — назва тварини.
    Виведіть створений словник на екран.

    "Oleg" -> "Cat"
    "Anna" -> "Leopard"

    pet_dictionary = {key: value, key2: value2, ke}
    print()

    first_friend = input("Введіть імʼя першого друга: ")

    print(pet_dictionary["Mike"])
"""