"""
Завдання 2:

Напишіть програму для обчислення середньої оцінки студента з різних предметів, використовуючи словник.

Ваше завдання:

    Створити словник, де ключі – назви предметів, а значення – оцінки.
    Вивести словник та обчислити середню оцінку.

Приклад словника:
grades = {
    "Математика": 90,
    "Фізика": 85,
    "Інформатика": 95,
    "Історія": 80
}
"""

grades = {
    "Математика": 90,
    "Фізика": 85,
    "Інформатика": 95,
    "Історія": 80
}

print(grades)

s = 0
for value in grades.values():
    s += value

print(f"Grades' values: {list(grades.values())}")
print(f"Average mark is {s / len(grades)}")

print(f"Average mark is {sum(grades.values()) / len(grades)}")
