"""
Завдання 4:

Напишіть програму, яка виводить словник у вигляді списку пар «ключ → значення».

Ваше завдання:

    Створити словник, де ключем є назва книги, а значенням — ім'я автора.
    Використовуючи метод словника items(), вивести кожну пару у форматі: Книга: <назва>, Автор: <ім'я>

"""

books = {
    "book1": "author 1",
    "book2": "author 2",
    "book3": "author 3",
    "book4": "author 4",
    "book5": "author 5"
}


for book_name, author_name in books.items():
    print(f"Book: {book_name}, Author: {author_name}")
