"""
Завдання 1:

Напишіть програму, яка знаходить всі парні числа в діапазоні від 1 до n.
Ваше завдання:
    1. Запитати у користувача число n.
    2. Використовуючи цикл for, знайти всі парні числа в діапазоні від 1 до n.
    3. Вивести знайдені числа.

    Підказка: Число є парним, якщо воно ділиться на 2 без залишку. i % 2 == 0

"""

n = int(input("Введіть будь яке число: "))
rng = range(0, n + 1, 1)

print("Всі парні числа від 0 до " + str(n) + ":")
for number in rng:
    if number % 2 == 0:
        print(number)