"""
Завдання:
Навчитися працювати з базовими типами даних (str, int, float) та умовними операторами, а також створювати прості програми з використанням вводу та виводу.

1. Запитайте у користувача його ім'я, вік та зріст
2. Виведіть вітання: "Привіт, {name}! Давайте дізнаємось кілька цікавих фактів про вас."
3. Розрахуйте "жартівливий" факт про зріст у перший рік життя. Щось типу "Якщо б ви росли рівномірно, то в один рік ваш зріст складав би приблизно ... см!"
4. Розрахуйте кількість прожитих днів
5. Зріст у метрах
6. Перевірте, чи є користувач повнолітнім
"""

print("Hello user!")
name = input("Будь-ласка введіть ім'я:")
age = int(input("Будь-ласка введіть ваш вік:"))
height = int(input("Будь-ласка введіть ваш зріст:"))
print(type(name), type(age), type(height)  )
print(f"Привіт, {name}! Давайте дізнаємось кілька цікавих фактів про вас.")

relative_height = height / age
print(f"Якщо б ви росли рівномірно, то в один рік ваш зріст складав би приблизно {relative_height} см!")

age_in_days = age * 365
print(f"Орієнтовний вік у днях: {age_in_days}")

height_in_meters = int(height / 100)
print(f"Ваш зріст у метрах: {height_in_meters}")

if age >= 18:
    print("Ви повнолітній")
else:
    print("Ви не повнолітній")
