"""
Завдання:
Навчитися працювати з базовими типами даних (str, int, float) та умовними операторами, а також створювати прості програми з використанням вводу та виводу.

1. Запитайте у користувача його ім'я, вік та зріст
2. Виведіть вітання: "Привіт, {name}! Давайте дізнаємось кілька цікавих фактів про вас."
3. Розрахуйте "жартівливий" факт про зріст у перший рік життя. Щось типу "Якщо б ви росли рівномірно, то в один рік ваш зріст складав би приблизно ... см!"
4. Розрахуйте кількість прожитих днів
5. Зріст у метрах
6. Перевірте, чи є користувач повнолітнім
"""

