"""
Мета:
Закріпити знання про числові функції Python, їх використання та взаємодію з різними типами чисел.

Завдання:
Напишіть програму, яка:
    1. Приймає від користувача два числа: x і y.
    2. Обчислює:
            Модуль числа x за допомогою abs().
            Значення x у двійковій системі числення за допомогою bin().
            Результат піднесення x до степеня y за допомогою pow().
            Результат округлення числа y до одного знака після коми за допомогою round().
            Максимальне і мінімальне значення між x і y.
Виведіть результати обчислень на екран у зручному для читання форматі.
"""