"""
Мета:
Закріпити знання про числові функції Python, їх використання та взаємодію з різними типами чисел.

Завдання:
Напишіть програму, яка:
    1. Приймає від користувача два числа: x і y.
    2. Обчислює:
            Модуль числа x за допомогою abs().
            Значення x у двійковій системі числення за допомогою bin(). oct() hex()
            Результат піднесення x до степеня y за допомогою pow(). x**y
            Результат округлення числа y до одного знака після коми за допомогою round().
            Максимальне і мінімальне значення між x і y.
Виведіть результати обчислень на екран у зручному для читання форматі.
"""

x = eval(input("Введіть змінну х: "))
y = eval(input("Введіть змінну y: "))
print("x=" + str(x))
print("y=" + str(y))

c = abs(x)
print(f"Модуль числа х = {c}")

print(f"Значення x у 2-й системі числення: {bin(x)}")

o = oct(x)
h = hex(x)

print(f"Значення x у 8-й системі числення: {o}")
print(f"Значення x у 16-й системі числення: {h}")

print(f"Результат піднесення x до степеня y: {pow(x, y)}")
print(f"Результат піднесення x до степеня y: {x ** y}")

print(f"Результат округлення числа y до одного знака після коми: {round(y)}")
print(f"Результат округлення числа y до одного знака після коми: {int(y)}")

print(f"Мінімальне значення між x і y {min(x, y)}")
print(f"Максимальне значення між x і y {max(x, y)}")

num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100, 344]
print(f"Мінімальне число у списку {min(num)}")
print(f"Максимальне число у списку {max(num)}")