"""
Завдання 2: Обробка речень

Напишіть програму, яка аналізує речення, розбиває його на окремі слова та перевіряє їх характеристики.

Ваше завдання:

    Запитати у користувача речення.
    Видалити зайві пробіли на початку і в кінці (strip()).
    Розбити речення на список слів (split()).
    Вивести список слів.
    Для кожного слова перевірити:
        чи складається слово лише з літер (isalpha()),
        чи є слово числом (isdigit()).
    Вивести статистику:
        кількість слів у реченні,
        кількість чисел у реченні,
        кількість "чистих" слів (тільки літери).

Підказка: Використовуйте методи strip(), split(), isalpha(), isdigit().
"""

text = input("Write a text")
text = text.strip()
split_text = text.split()
print(split_text)
for i in split_text:
    if i.isalpha():
        print(i + " is alpha")
print(text.count("d"))