"""
Завдання 1: Аналіз текстового рядка

Напишіть програму, яка аналізує введений користувачем текст та виконує наступні дії:

Ваше завдання:

    Запитати у користувача текстовий рядок.
    Вивести текст у:
        верхньому регістрі (upper()),
        нижньому регістрі (lower()),
        форматі заголовка (title()).
    Підрахувати кількість символів у введеному тексті (len()).
    Запитати у користувача слово для пошуку в тексті.
    Перевірити, чи міститься це слово у тексті (in або find()).
    Вивести відповідне повідомлення про наявність або відсутність слова.

Підказка: Використовуйте методи upper(), lower(), title(), len(), find() або оператор in.

1 in text
"""
text =  input("Write a text:")
print(text.upper())
print(text.lower())
print(text.title())
print(text.swapcase())
print(len(text))
print(text.find("a"))
print("a" in text)
