"""
Завдання 2: Робота зі зрізами списку

    Створіть список чисел, кратних 5, від 5 до 50.
    Отримайте всі елементи списку, крім першого і останнього.
    Виведіть кожен другий елемент списку.
    Створіть новий список, який містить останні 3 елементи вихідного списку за допомогою від’ємних індексів.
    Спробуйте отримати порожній список за допомогою некоректного зрізу (наприклад, коли перший індекс більший за другий).

Очікуваний результат:

    Створений список: [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
    Без першого і останнього: [10, 15, 20, 25, 30, 35, 40, 45]
    Кожен другий елемент: [5, 15, 25, 35, 45]
    Останні три елементи: [40, 45, 50]
    Порожній список: []


list(range(start, stop, step))
numbers[1:4:3]

numbers[-5:]
numbers[10:5] = []
"""