"""
Завдання 1

Напишіть програму, яка демонструє основні операції зі створення та модифікації множин, а також створення frozenset.

Ваше завдання:

1. Створіть порожню множину set1.
2. Додайте до неї кілька елементів (на ваш вибір) за допомогою методу **add()**.
3. Видаліть один із доданих елементів за допомогою методу **discard()** (або **remove()**, але **discard()** безпечніший, якщо елемента може не бути).
4. Створіть **frozenset** на основі (оновленої) множини set1 і збережіть його в змінну fs. Спробуйте викликати метод .add() на ньому. Чи вийшло? Чому?
5. Виведіть на екран усі результати:
   - Початкову порожню множину (після створення).
   - Множину після додавання елементів.
   - Множину після видалення елемента.
   - Створений frozenset

   nums = set()
   nums = frozenset()
   nums.add(1)
   nums.remove(4)
   nums = {i**2 for i in range(1, 11)}
"""

set1 = set()
set1.add(1)
set1.add(2)
set1.add("Hello world")
print(set1)

set1.remove(1)
print(set1)

set1.discard(5)
print(set1)


fs = frozenset(set1)
print(fs)

fs.discard(3)
print(fs)