"""
Напишіть програму, яка демонструє роботу з кортежами.

Ваше завдання:

1. Створіть функцію create_tuple(lst), яка приймає список lst та повертає кортеж на його основі.
2. Створіть функцію analyze_tuple(tpl), яка виконує такі дії:
   - Виводить довжину кортежу (кількість елементів).
   - Виводить перший та останній елементи кортежу.
   - Виводить кількість входжень числа 10 (за допомогою методу *count()*).
   - Якщо число 20 міститься в кортежі, виводить його індекс (за допомогою методу *index()*).
3. Перевірте роботу обох функцій, використовуючи список [10, 20, 10, 30, 40].
"""