"""
Завдання 1: Аналіз доходів магазинів

Опис:
У вас є словник із назвами магазинів і їхніми щомісячними доходами. Створіть Series, проведіть базовий аналіз і виведіть корисну інформацію.

revenues = {
    'Shop_A': 15000,
    'Shop_B': 12500,
    'Shop_C': 9800,
    'Shop_D': 17500
}

Завдання:

    Створіть Series із цього словника.

    Виведіть список магазинів, де дохід перевищує 13 000.

    Обчисліть середній дохід по всіх магазинах.

    Застосуйте 5% податок — виведіть нову Series з прибутками після податку.

    Чи є серед доходів значення 9800? Виведіть результат за допомогою isin().
"""