"""
Завдання:
Ви працюєте аналітиком у невеликому інтернет-магазині.
Вам надали Excel-файл з даними про січневі замовлення, однак файл містить пропущені значення
та не всі поля мають зручну структуру. Ваше завдання — підготувати таблицю для подальшого аналізу.

Крок 1: Завантажити дані з Excel (pd.read_excel)
Крок 2: Попередня обробка:
    Заповніть пропущені значення:
        У колонці DeliveryCity — заповніть 'Unknown'
        У колонці Quantity — заповніть 1
        У колонці Discount — заповніть 0.0

Крок 3: Додайте обчислювані колонки
    TotalPrice = Quantity * PricePerItem
    DiscountedPrice = TotalPrice * (1 - Discount)
Крок 4: Знайдіть непотрібну колонку та видаліть її
Крок 5: Збережіть результат в новому Excel-файлі (pd.DataFrame.to_excel)
"""
