"""
Завдання 2: Злиття та робота з пропущеними значеннями

Опис:
Два менеджери ввели дані про кількість проданих товарів, але з частковими мітками.

data1 = {'milk': 20, 'bread': 15, 'butter': 10}
data2 = {'bread': 17, 'milk': 22, 'cheese': 8}

Завдання:

    Створіть два Series s1 і s2 з цих словників.

    Об’єднайте їх (s1 + s2) і виведіть суму продажів.

    Визначте, які продукти мають NaN у результаті.

    Замініть всі NaN значення на 0.

    Обчисліть загальну кількість проданих одиниць товарів після заміни NaN.
"""