"""
Просте наслідування: «Книжки в бібліотеці» (оновлене)

Створи базовий клас Book, який містить:

    поля: title (назва), author (автор), year (рік видання)

    метод info(), який виводить:

        Назва: <title>, Автор: <author>, Рік: <year>

    метод age(current_year), який повертає кількість років із моменту видання книжки:

Створи похідний клас EBook, який:

    успадковує всі властивості класу Book

    додає поле file_format

    перевизначає метод info(), додаючи відображення формату:

Назва: <title>, Автор: <author>, Рік: <year>, Формат: <file_format>

"""