"""
Мета: Ознайомитися з використанням умовних операторів if, elif, else у Python, а також застосуванням математичних функцій і операцій.

Завдання 1: Напишіть програму, яка запитує у користувача число і виконує такі дії:

    Якщо число парне, обчисліть його квадратний корінь (використовуючи math.sqrt).
    Якщо число непарне, піднесіть його до кубу.
    Якщо число менше 0, виведіть повідомлення, що від'ємні числа не підтримуються для цих операцій.

Завдання 2: Напишіть програму, яка запитує у користувача трикутник із трьома сторонами a, b, c і:

    Перевіряє, чи можна з цих сторін утворити трикутник (використовуючи нерівність трикутника: a + b > c, a + c > b, b + c > a).
    Якщо можна утворити трикутник, визначає, чи є трикутник:
        рівностороннім (усі сторони рівні),
        рівнобедреним (дві сторони рівні),
        різностороннім (усі сторони різні).
    Якщо трикутник утворити неможливо, вивести повідомлення: "Це не трикутник."
"""