"""
Завдання 2:

Напишіть програму, яка використовує аргументи за замовчуванням та функцію з невизначеною кількістю аргументів.

Ваше завдання:

    Створіть функцію describe_pet(), яка приймає два аргументи: ім'я тварини та її вид. Вид тварини має значення за замовчуванням "кіт".
    Створіть функцію describe_pets(), яка приймає невизначену кількість імен і виводить на екран повідомлення типу .
    "Ось мої тварини: ім'я1, ім'я2, ім'я3, ..."
    Перевірте роботу обох функцій.

Приклад роботи програми:

describe_pet("Барсик")       # Очікуваний результат: У мене є кіт на ім'я Барсик.
describe_pet("Рекс", "собака")  # Очікуваний результат: У мене є собака на ім'я Рекс.

describe_pets("Барсик", "Рекс", "Муся")  # Очікуваний результат: Ось мої тварини: Барсик, Рекс, Муся.
describe_pets("Барсик", "Рекс")  # Очікуваний результат: Ось мої тварини: Барсик, Рекс.
"""